lvx/base/DataProcessors/бит_ПолучениеДанныхПоИсточникам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>бит_ПолучениеДанныхПоИсточникам</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИсточникДанных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СпособыКомпоновкиИсточниковДанных</v8:Type>
						<v8:Type>cfg:CatalogRef.бит_ИсточникиДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаПулаПодключений</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_мпд_НастройкиПуловПодключений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяЗаполняемойТаблицы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

lvx/base/Enums/бит_ВидыПараметровЗапроса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ВидыПараметровЗапроса</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Значение</Name>
					<Comment>Значение</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Список</Name>
					<Comment>Список</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выражение</Name>
					<Comment>Выражение</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

lvx/base/Enums/бит_ТипыСохраненныхНастроек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ТипыСохраненныхНастроек</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НастройкиПанелиИндикаторов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отчеты</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

lvx/base/DataProcessors/бит_ПолучениеДанныхПоИсточникам/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Параметры.ИмяЗаполняемойТаблицы) Тогда
		Элементы.ТаблицаДанныеМенюПеренести.Видимость = Ложь;
	КонецЕсли;   
	
	ВидыСравнения = бит_МеханизмПолученияДанных.СформироватьСписокВыбораДляОтборовВОтчете("Массив");
	Элементы.ОтборВОтчетеВидСравнения.СписокВыбора.ЗагрузитьЗначения(ВидыСравнения);
	
	// Список типов для быстрого выбора составного.
	ТипыИсточников = Метаданные.Обработки.бит_ПолучениеДанныхПоИсточникам.Реквизиты.ИсточникДанных.Тип.Типы();
	ТипыИсточниковДанных = бит_ОбщегоНазначения.ПодготовитьСписокВыбораТипа(ТипыИсточников);
	
	ОписаниеПроизвольногоТипа = бит_ОбщегоНазначения.ОписаниеПроизвольногоТипа();
	
	// Восстановление настройки по-умолчанию.
	УстановитьЗначенияПоУмолчанию();	
	
	// Заполнение данных обработки по параметрам.
	Параметры.Свойство("Организация", 			Объект.Организация);
	Параметры.Свойство("Сценарий", 				Объект.Сценарий);
	Параметры.Свойство("ЦФО", 					Объект.ЦФО);
	Параметры.Свойство("ВалютаДокумента", 		Объект.ВалютаДокумента);
	Параметры.Свойство("КурсДокумента", 		Объект.КурсДокумента);
	Параметры.Свойство("КратностьДокумента",    Объект.КратностьДокумента);
	Параметры.Свойство("ИмяЗаполняемойТаблицы", Объект.ИмяЗаполняемойТаблицы);	
	Если Параметры.Свойство("Дата") Тогда		
		Объект.Период = Новый СтандартныйПериод(НачалоМесяца(Параметры.Дата), КонецМесяца(Параметры.Дата));		
	КонецЕсли;
	
	ОбработатьИзменениеНастроек(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзменениеПериода" И УникальныйИдентификатор = Параметр Тогда
	
		ПриИзмененииПериода();
	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИсточникДанныхНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	бит_РаботаСДиалогамиКлиент.НачалоВыбораСоставного(ЭтотОбъект,
		Элемент, Объект, "ИсточникДанных", ТипыИсточниковДанных, СтандартнаяОбработка);
		
КонецПроцедуры

&НаКлиенте
Процедура ИсточникДанныхОчистка(Элемент, СтандартнаяОбработка)
	
	Элементы.ИсточникДанных.ВыбиратьТип = Истина;
	
	ИзмененыНастройки = Истина;
	ОбработатьИзменениеНастроек(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ИсточникДанныхПриИзменении(Элемент)
	
	ИсточникДанныхПриИзмененииНаСервере();
	
	ИзмененыНастройки = Истина;
	ОбработатьИзменениеНастроек(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	
	ПриИзмененииПериода();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)
	
	ПриИзмененииПериода();
	
КонецПроцедуры
	
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаДанные

&НаКлиенте
Процедура ТаблицаДанныеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Исключения = Новый Массив;
	Исключения.Добавить("ТаблицаДанныеВыполнять");
	Исключения.Добавить("ТаблицаДанныеПериод");
	
	Если Исключения.Найти(Поле.Имя) = Неопределено Тогда
		ИмяРеквизита = СтрЗаменить(Поле.Имя, "ТаблицаДанные_", "");
		ТекСтрока = Элементы.ТаблицаДанные.ТекущиеДанные;
		ТекЗначение = ТекСтрока[ИмяРеквизита];		
		Если ЗначениеЗаполнено(ТекЗначение) Тогда		
			ПоказатьЗначение(, ТекЗначение);		
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтборВОтчете

&НаКлиенте
Процедура ОтборВОтчетеВидСравненияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОтборВОтчете.ТекущиеДанные;
	ОтборВОтчетеВидСравненияПриИзмененииСервер(ТекущиеДанные.ПолучитьИдентификатор());	

КонецПроцедуры

&НаКлиенте
Процедура ОтборВОтчетеЗначениеПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОтборВОтчете.ТекущиеДанные;
	ОтборВОтчетеЗначениеПриИзмененииСервер(ТекущиеДанные.ПолучитьИдентификатор());
		
КонецПроцедуры

&НаКлиенте
Процедура ОтборВОтчетеПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущаяСтрока = Элементы.ОтборВОтчете.ТекущиеДанные;	
	
	Если ТекущаяСтрока.Значение = Неопределено Тогда		
		Элементы.ОтборВОтчетеЗначение.ВыбиратьТип = Истина;		
	Иначе		
		Элементы.ОтборВОтчетеЗначение.ВыбиратьТип = Ложь;		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборВОтчетеПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ИзмененыНастройки = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборВОтчетеЗначениеОчистка(Элемент, СтандартнаяОбработка)
	
	Элементы.ОтборВОтчетеЗначение.ВыбиратьТип = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПараметры

&НаКлиенте
Процедура ТаблицаПараметрыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанные = Элементы.ТаблицаПараметры.ТекущиеДанные; 	
	
	Если НоваяСтрока И НЕ Копирование Тогда  		
		ТекущиеДанные.ВидПараметра = ПредопределенноеЗначение("Перечисление.бит_ВидыПараметровЗапроса.Значение");
	КонецЕсли; 
	ПредыдущийВидПараметра = ТекущиеДанные.ВидПараметра;
	ОграничитьОписаниеТиповПараметра();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПараметрыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ИзмененыНастройки = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПараметрыВидПараметраПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ТаблицаПараметры.ТекущиеДанные;	
	Если ТекущиеДанные <> Неопределено Тогда
		
		Идентификатор = ТекущиеДанные.ПолучитьИдентификатор();
		ИзменитьВидПараметра(Идентификатор);
		ПредыдущийВидПараметра = ТекущиеДанные.ВидПараметра;
		ОграничитьОписаниеТиповПараметра();
	
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПараметрыЗначениеПараметраНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ТаблицаПараметры.ТекущиеДанные;	
	Если ТекущиеДанные.ВидПараметра = ПредопределенноеЗначение("Перечисление.бит_ВидыПараметровЗапроса.Выражение") Тогда
		СтандартнаяОбработка = Ложь;			
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПараметрыЗначениеПараметраОчистка(Элемент, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ТаблицаПараметры.ТекущиеДанные;	
	Если ТекущиеДанные.ВидПараметра = ПредопределенноеЗначение("Перечисление.бит_ВидыПараметровЗапроса.Значение") Тогда		
		Элементы.ТаблицаПараметрыЗначениеПараметра.ВыбиратьТип = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область РаботаСНастройками

&НаКлиенте
Процедура ПоказатьНастройки(Команда)
	
	ОткрытьНастройки();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьНастройки(Команда)
	
	СкрытьНастройки();
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройки(Команда)
	
	ПараметрыФормы = ПараметрыХраненияНастроек();
	ПараметрыФормы.Вставить("СтруктураНастройки" , СохраняемыеНастройки());
	
	Если ЗначениеЗаполнено(ТекущаяНастройка) Тогда	
		ПараметрыФормы.Вставить("СохраненнаяНастройка", ТекущаяНастройка);  	
	КонецЕсли; 
		
	ОповещениеЗакрытиеФормы = Новый ОписаниеОповещения("СохранитьНастройкиЗавершение", ЭтотОбъект);
	ОткрытьФорму("ХранилищеНастроек.бит_ХранилищеНастроек.ФормаСохранения", ПараметрыФормы, 
		ЭтотОбъект,,,, ОповещениеЗакрытиеФормы, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьНастройки(Команда)
	
	ПараметрыФормы = ПараметрыХраненияНастроек();
	
	ОповещениеЗакрытиеФормы = Новый ОписаниеОповещения("ВыбратьНастройкиЗавершение", ЭтотОбъект);
	ОткрытьФорму("ХранилищеНастроек.бит_ХранилищеНастроек.ФормаЗагрузки", 
		ПараметрыФормы, ЭтотОбъект,,,, ОповещениеЗакрытиеФормы, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСПериодом

&НаКлиенте
Процедура НастроитьПериод(Команда)
	
	бит_РаботаСДиалогамиКлиент.ОткрытьДиалогСтандартногоПериода(Объект, "Период",, УникальныйИдентификатор);
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСТаблицейФормыТаблицаДанные

&НаКлиенте
Процедура ОбновитьДанные(Команда)
	
	Если ТаблицаДанные.Количество() = 0 Тогда
		НачатьОтложенноеОбновлениеДанных();
	Иначе	
		Если ПодтверждениеОчисткиДанных() Тогда
        	НачатьОтложенноеОбновлениеДанных();		 	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФлагиУстановитьВсе(Команда)
	
	бит_РаботаСДиалогамиКлиент.ОбработатьФлагиТаблицы(ТаблицаДанные, "Выполнять", 1, Элементы.ТаблицаДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ФлагиСнятьВсе(Команда)
	
	бит_РаботаСДиалогамиКлиент.ОбработатьФлагиТаблицы(ТаблицаДанные, "Выполнять", 0, Элементы.ТаблицаДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ФлагиИнвертировать(Команда)
	
	бит_РаботаСДиалогамиКлиент.ОбработатьФлагиТаблицы(ТаблицаДанные, "Выполнять", 2, Элементы.ТаблицаДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВДокумент(Команда)
	
	ОповеститьОВыбореДанных("Добавить");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьВДокумент(Команда)
	
	ОповеститьОВыбореДанных("Заполнить");
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбщиеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Функция НастраиваемыйОбъект()

	Возврат "Обработка.бит_ПолучениеДанныхПоИсточникам";

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовок(Форма, Настройка)
	
	Заголовок = НСтр("ru='Получение данных по источникам %1'; 
					 |en='Getting Data by Sources %1'");
	
	Если ЗначениеЗаполнено(Настройка) Тогда
		Заголовок = СтрШаблон(Заголовок, "(" + Строка(Настройка) + ")");
	Иначе	
		Заголовок = СтрШаблон(Заголовок, "");
	КонецЕсли;

	Форма.Заголовок = Заголовок;
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСЭлементамиФормы

&НаКлиенте
Процедура ПриИзмененииПериода()
	
	ИзмененыНастройки = Истина;
	ОбработатьИзменениеНастроек(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ИсточникДанныхПриИзмененииНаСервере()
	
	ЗаполнитьТаблицуОтборов();
	ОбновитьТаблицуПараметров();
	
	УстановитьОбязательныеОтборы("Сценарий" , 	Объект.Сценарий);
	УстановитьОбязательныеОтборы("Организация", Объект.Организация);
	УстановитьОбязательныеОтборы("ЦФО", 		Объект.ЦФО);
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСНастройками

&НаКлиентеНаСервереБезКонтекста
Процедура ОбработатьИзменениеНастроек(Форма)

	Форма.Элементы.ДекорацияИзмененыНастройки.Видимость = Форма.ИзмененыНастройки;
	Форма.Элементы.ТаблицаДанные.Доступность 			= НЕ Форма.ИзмененыНастройки;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройки()

	Элементы.РазделыОбработки.ТекущаяСтраница	  = Элементы.СтраницаНастройки;
	Элементы.ПрименитьНастройки.КнопкаПоУмолчанию = Истина;	

КонецПроцедуры

&НаКлиенте
Процедура СкрытьНастройки()

	Элементы.РазделыОбработки.ТекущаяСтраница = Элементы.СтраницаОбработка;
	Элементы.ОбновитьДанные.КнопкаПоУмолчанию = Истина;

	Если ИзмененыНастройки Тогда
		ОбработатьИзменениеНастроек(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПараметрыХраненияНастроек()

	ПараметрыХранения = Новый Структура;
	ПараметрыХранения.Вставить("ТипНастройки", ПредопределенноеЗначение("Перечисление.бит_ТипыСохраненныхНастроек.Обработки"));
	ПараметрыХранения.Вставить("НастраиваемыйОбъект", НастраиваемыйОбъект());

	Возврат ПараметрыХранения;
	
КонецФункции

&НаСервере
Функция НовыеСохраняемыеНастройки()

	НовыеНастройки = Новый Структура;	
	НовыеНастройки.Вставить("ИсточникДанных", 	Неопределено);
	НовыеНастройки.Вставить("Период", 			Новый СтандартныйПериод);
	НовыеНастройки.Вставить("ОтборВОтчете", 	Неопределено);
	НовыеНастройки.Вставить("ТаблицаПараметры", Неопределено);

	Возврат НовыеНастройки;
	
КонецФункции

&НаСервере
Функция СохраняемыеНастройки()
	
	СохраняемыеНастройки = НовыеСохраняемыеНастройки();
	ЗаполнитьЗначенияСвойств(СохраняемыеНастройки, Объект);
	
	СохраняемыеНастройки.ОтборВОтчете 	  = Новый ХранилищеЗначения(РеквизитФормыВЗначение("ОтборВОтчете"));
	СохраняемыеНастройки.ТаблицаПараметры = Новый ХранилищеЗначения(РеквизитФормыВЗначение("ТаблицаПараметры")); 
	
	Возврат СохраняемыеНастройки;
	
КонецФункции
		
// Обработчик завершения открытия формы.
//  См. Синтакс-помощник: ОткрытьФорму().
// 
&НаКлиенте
Процедура СохранитьНастройкиЗавершение(Результат, ДопПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		ТекущаяНастройка = Результат;
		УстановитьЗаголовок(ЭтотОбъект, Результат);
	КонецЕсли;

КонецПроцедуры

// Обработчик завершения открытия формы.
//  См. Синтакс-помощник: ОткрытьФорму().
// 
&НаКлиенте
Процедура ВыбратьНастройкиЗавершение(Результат, ДопПараметры) Экспорт

	Если ЗначениеЗаполнено(Результат) Тогда        
		ТекущаяНастройка = Результат;
		ПрименитьНастройки(ТекущаяНастройка);
		ОбработатьИзменениеНастроек(ЭтотОбъект);
	КонецЕсли;

КонецПроцедуры

// Функция применяет сохраненные настройки.
// 
// Параметры:
//  ВыбраннаяНастройка - СправочникСсылка.бит_СохраненныеНастройки.
// 
&НаСервере
Процедура ПрименитьНастройки(ВыбраннаяНастройка)
	
	Если ЗначениеЗаполнено(ВыбраннаяНастройка) Тогда
		
		ХранилищеНастроек 	 = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыбраннаяНастройка, "ХранилищеНастроек");
		СохраненныйНастройки = ХранилищеНастроек.Получить();
		
		Если ТипЗнч(СохраненныйНастройки) = Тип("Структура") Тогда
			
			ЗаполнитьЗначенияСвойств(Объект, СохраненныйНастройки);

			Если СохраненныйНастройки.Свойство("СтандартныйПериод") Тогда
				Объект.Период = СохраненныйНастройки.СтандартныйПериод;
			КонецЕсли;
			Если Объект.Период.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод Тогда
				Объект.Период = Новый СтандартныйПериод(ВариантСтандартногоПериода.ЭтотМесяц); 
			Иначе	
				Объект.Период = Новый СтандартныйПериод(Объект.Период.Вариант); 
			КонецЕсли;
			
			// Обратная совместимость.
			Если ТипЗнч(СохраненныйНастройки.ОтборВОтчете) = Тип("ТаблицаЗначений") Тогда
				СохраненыйОтбор = СохраненныйНастройки.ОтборВОтчете;
			Иначе	
				СохраненыйОтбор = бит_ОбщегоНазначения.РаспаковатьТаблицуЗначений(СохраненныйНастройки.ОтборВОтчете);
			КонецЕсли;
			ЗначениеВРеквизитФормы(СохраненыйОтбор, "ОтборВОтчете");
			
			Если ТипЗнч(СохраненныйНастройки.ТаблицаПараметры) = Тип("ТаблицаЗначений") Тогда
				СохраненыеПараметры = СохраненныйНастройки.ТаблицаПараметры;
			Иначе	
				СохраненыеПараметры = бит_ОбщегоНазначения.РаспаковатьТаблицуЗначений(СохраненныйНастройки.ТаблицаПараметры);
			КонецЕсли;
			ЗначениеВРеквизитФормы(СохраненыеПараметры, "ТаблицаПараметры");
			
		КонецЕсли;		
	КонецЕсли; 
	
	УстановитьЗаголовок(ЭтотОбъект, ВыбраннаяНастройка);
	ОбработатьИзменениеНастроек(ЭтотОбъект);
	 	 
КонецПроцедуры

// Процедура устанавливает настройку либо из последних использованных, либо из настройки по умолчанию.
// 
&НаСервере
Процедура УстановитьЗначенияПоУмолчанию()
	
	// Получим настройку по - умолчанию и последнюю использованну.
	НастройкаПоУмолчанию = бит_ОтчетыСервер.НайтиНастройкуПоУмолчаниюДляОбъекта(НастраиваемыйОбъект());
	
	Если ЗначениеЗаполнено(НастройкаПоУмолчанию) Тогда 		
		ПрименитьНастройки(НастройкаПоУмолчанию);
	Иначе
		УстановитьЗаголовок(ЭтотОбъект, "");
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСТаблицейФормыТаблицаДанные

// Функция запрашивает у пользователя подтверждение на очистку данных.
// 
// Возвращаемое значение:
//  Булево.
// 
&НаКлиенте
Функция ПодтверждениеОчисткиДанных()
	
	Выполнять = Истина;
	
	Если ТаблицаДанные.Количество() > 0  Тогда
		
		Выполнять = Ложь;
		
		ТекстВопроса = НСтр("ru='Данные будут очищены. Продолжить?';en='Data will be cleared. Continue?'");
		Оповещение = Новый ОписаниеОповещения("ПодтверждениеОчисткиДанныхЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 15, КодВозвратаДиалога.Нет);
				
	КонецЕсли; 
	
	Возврат Выполнять;
	
КонецФункции // ПодтверждениеОчисткиДанных()

// Процедура - обработчик оповещения "ПодтверждениеОчисткиДанныхЗавершение".
// 
// Параметры:
//  Ответ 			     - КодВозвратаДиалога.
//  ДополнительныеДанные - Структура.
// 
&НаКлиенте 
Процедура ПодтверждениеОчисткиДанныхЗавершение(Ответ, ДополнительныеДанные) Экспорт

	Если Ответ = КодВозвратаДиалога.Да Тогда
	     // Выполнение по запросу от пользователя.
		 НачатьОтложенноеОбновлениеДанных();
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСТаблицейФормыТаблицаПараметры

&НаСервере
Процедура ОбновитьТаблицуПараметров()
	
	бит_МеханизмПолученияДанных.ОбновитьТаблицуПараметров(Объект.ИсточникДанных, ТаблицаПараметры, Ложь);
	
КонецПроцедуры

// Процедура ограничивает описание типов в строке таблица параметров.
// 
&НаКлиенте
Процедура ОграничитьОписаниеТиповПараметра()

	ТекущиеДанные = Элементы.ТаблицаПараметры.ТекущиеДанные;
	
	Если ТекущиеДанные.ВидПараметра = ПредопределенноеЗначение("Перечисление.бит_ВидыПараметровЗапроса.Выражение") Тогда			
		ОписаниеОграничение = Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(500));
	Иначе
		Если ТекущиеДанные.ЗначениеПараметра = Неопределено Тогда  		
			Элементы.ТаблицаПараметрыЗначениеПараметра.ВыбиратьТип = Истина; 		
		Иначе	                                                        		
			Элементы.ТаблицаПараметрыЗначениеПараметра.ВыбиратьТип = Ложь;  		
		КонецЕсли; 
		
		ДобавляемыеТипы = Новый Массив;
		ДобавляемыеТипы.Добавить(Тип("СписокЗначений"));
		Если ЗначениеЗаполнено(ТекущиеДанные.ДоступныеТипы) Тогда
			ОписаниеОграничение = Новый ОписаниеТипов(ТекущиеДанные.ДоступныеТипы, ДобавляемыеТипы);
		Иначе		
			ОписаниеОграничение = Новый ОписаниеТипов(ОписаниеПроизвольногоТипа, ДобавляемыеТипы);
		КонецЕсли;
	КонецЕсли;	
	
	// Ограничение типа значения.
	Элементы.ТаблицаПараметрыЗначениеПараметра.ОграничениеТипа = ОписаниеОграничение;  

КонецПроцедуры

&НаСервере
Процедура ИзменитьВидПараметра(ИД)

	ТекущиеДанные = ТаблицаПараметры.НайтиПоИдентификатору(ИД);
	бит_МеханизмПолученияДанных.ИзменениеВидаПараметра(ТекущиеДанные, ПредыдущийВидПараметра);

КонецПроцедуры

#КонецОбласти

#Область РаботаСТаблицейФормыОтборВОтчете
	
&НаСервере
Процедура ЗаполнитьТаблицуОтборов()

	ТаблицаОтборов = РеквизитФормыВЗначение("ОтборВОтчете");
	бит_МеханизмПолученияДанных.ЗаполнитьОтборВОтчете(Объект.ИсточникДанных, ТаблицаОтборов);
	ЗначениеВДанныеФормы(ТаблицаОтборов, ОтборВОтчете);	

КонецПроцедуры

// Процедура устанавливает значения параметров и значения отборов по определенному имени.
// Используется при открытии из операции для установки отборов по сценарию или организации.
// 
// Параметры:
//  Имя - Строка.
//  ЗначениеОтбора - Произвольный.
// 
&НаСервере
Процедура УстановитьОбязательныеОтборы(Имя, ЗначениеОтбора)
	
	Если ЗначениеЗаполнено(ЗначениеОтбора) Тогда
		
		СтрОтбор = Новый Структура("ИмяПараметра", Имя);		
		МассивСтрок = ТаблицаПараметры.НайтиСтроки(СтрОтбор);		
		Для каждого СтрокаТаблицы Из МассивСтрок Цикл			
			СтрокаТаблицы.ЗначениеПараметра = ЗначениеОтбора;			
		КонецЦикла; 
		
		СтрОтбор = Новый Структура("Имя", Имя);		
		МассивСтрок = ОтборВОтчете.НайтиСтроки(СтрОтбор);		
		Для каждого СтрокаТаблицы Из МассивСтрок Цикл			
			СтрокаТаблицы.Значение = ЗначениеОтбора;
			СтрокаТаблицы.Использование = Истина;			
		КонецЦикла; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ОтборВОтчетеВидСравненияПриИзмененииСервер(Ид)
		
	ТекущиеДанные = ОтборВОтчете.НайтиПоИдентификатору(Ид);
	бит_МеханизмПолученияДанных.ИзменениеВидаСравнения(ТекущиеДанные);	

КонецПроцедуры

&НаСервере
Процедура ОтборВОтчетеЗначениеПриИзмененииСервер(Ид)
	
	ТекущиеДанные = ОтборВОтчете.НайтиПоИдентификатору(Ид);
	бит_МеханизмПолученияДанных.ОтборВОтчетеЗначениеПриИзменении(ТекущиеДанные);
		
КонецПроцедуры

#КонецОбласти

#Область ОбновлениеТаблицыДанных

&НаКлиенте
Процедура НачатьОтложенноеОбновлениеДанных()
	
	Отказ = НЕ ПроверитьЗаполнение();
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ИзмененыНастройки = Ложь;	
	СкрытьНастройки();
	ОбработатьИзменениеНастроек(ЭтотОбъект);
	
	ДлительнаяОперация    = НачатьОтложенноеОбновлениеДанныхНаСервере();
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОтложенноеОбновлениеДанныхЗавершение", ЭтотОбъект);
	ПараметрыОжидания     = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция НачатьОтложенноеОбновлениеДанныхНаСервере()
			
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ВыполняемыйМетод    = "Обработки.бит_ПолучениеДанныхПоИсточникам.ПолучитьДанные";

	ДанныеОбъекта = Новый Структура("ИсточникДанных, Период, НастройкаПулаПодключений, КурсВалюты");
	ЗаполнитьЗначенияСвойств(ДанныеОбъекта, Объект);
	
	ДанныеОбъекта.КурсВалюты = Новый Структура;
	ДанныеОбъекта.КурсВалюты.Вставить("ВалютаОтчета", 	 Объект.ВалютаДокумента);
	ДанныеОбъекта.КурсВалюты.Вставить("КурсОтчета", 	 Объект.КурсДокумента);
	ДанныеОбъекта.КурсВалюты.Вставить("КратностьОтчета", Объект.КратностьДокумента);

	ДанныеФормы = Новый Структура;
	ДанныеФормы.Вставить("ОтборВОтчете", 	 РеквизитФормыВЗначение("ОтборВОтчете"));
	ДанныеФормы.Вставить("ТаблицаПараметры", РеквизитФормыВЗначение("ТаблицаПараметры"));
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, ВыполняемыйМетод, 
				ДанныеОбъекта, ДанныеФормы);
	
КонецФункции
			
&НаКлиенте
Процедура ОтложенноеОбновлениеДанныхЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ТекстСообщения = НСтр("ru = 'Ошибка при выполнении, по причине: %1'"); 
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон(ТекстСообщения, Результат.КраткоеПредставлениеОшибки));
	Иначе	
		ОбновлениеДанныхЗавершениеНаСервере(Результат.АдресРезультата);
	КонецЕсли; 
	
КонецПроцедуры 

&НаСервере
Процедура ОбновлениеДанныхЗавершениеНаСервере(АдресРезультата)

	ТаблицаДанные.Очистить();
	
	ТаблицаРезультат = ПолучитьИзВременногоХранилища(АдресРезультата);		
	УдалитьИзВременногоХранилища(АдресРезультата);
	
	Если НЕ ЗначениеЗаполнено(ТаблицаРезультат) Тогда		
		ТекстСообщения = НСтр("ru='Нет данных, удовлетворяющих отбору';en='No data satisfying the selection'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);		
		Возврат;		
	КонецЕсли;

	// Удаление реквизитов и колонок таблицы.
	УдалитьДинамическиеЭлементы();	
	// Динамическое создание реквизитов таблицы и колонок таблицы.
	ДобавитьДинамическиеЭлементы(ТаблицаРезультат);
	
	Для каждого СтрокаТаблицы Из ТаблицаРезультат Цикл	
		НоваяСтрока = ТаблицаДанные.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);	
	КонецЦикла;

КонецПроцедуры

// Процедура удаляет динамически созданные реквизиты и элементы формы.
// 
&НаСервере
Процедура УдалитьДинамическиеЭлементы()
	
	// Удаление "динамически созданных" реквизитов.
	МассивРеквизитов = ПолучитьРеквизиты("ТаблицаДанные");
	
	УдаляемыеРеквизиты = Новый Массив;
	Для каждого РеквФормы Из МассивРеквизитов Цикл
		
		Если ВРег(РеквФормы.Имя) <> ВРег("Выполнять") Тогда			
			УдаляемыеРеквизиты.Добавить(РеквФормы.Путь + "." + РеквФормы.Имя);			
		КонецЕсли; 
		
	КонецЦикла; // МассивРеквизитов
	
	ИзменитьРеквизиты(,УдаляемыеРеквизиты);
	
	// Удаление "динамически созданных" элементов управления.	
	УдаляемыеЭлементы = Новый Массив;
	Для каждого ЭлФормы Из Элементы.ТаблицаДанные.ПодчиненныеЭлементы Цикл
		
		Если ВРег(ЭлФормы.Имя) <> ВРег("ТаблицаДанныеВыполнять") Тогда			
			// Удаляем динамические элементы шапки
			УдаляемыеЭлементы.Добавить(ЭлФормы);			
		КонецЕсли; 
		
	КонецЦикла; // Элементы
	
	Для каждого ЭлФормы Из УдаляемыеЭлементы Цикл		
		Элементы.Удалить(ЭлФормы);		
	КонецЦикла; 
	
КонецПроцедуры

// Процедура добавляет реквизиты и элементы управления.
//
// Параметры:
//  ТаблицаРезультат - ТаблицаЗначений.
//
&НаСервере
Процедура ДобавитьДинамическиеЭлементы(ТаблицаРезультат)
	
	// Динамическое создание реквизитов таблицы и колонок таблицы.
	ДобавляемыеРеквизиты = Новый Массив;		
	Для каждого ТекКолонка Из ТаблицаРезультат.Колонки Цикл		
		НовыйРеквизит = Новый РеквизитФормы(ТекКолонка.Имя, ТекКолонка.ТипЗначения, "ТаблицаДанные", ТекКолонка.Заголовок);
		ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);		
	КонецЦикла; 
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	Для каждого ТекКолонка Из ТаблицаРезультат.Колонки Цикл		
		ЭУ = Элементы.Добавить(ТекКолонка.Имя, Тип("ПолеФормы"), Элементы.ТаблицаДанные);
		ЭУ.ПутьКДанным 	  = "ТаблицаДанные."+ТекКолонка.Имя;		
		ЭУ.Вид         	  = ВидПоляФормы.ПолеВвода;
		ЭУ.ТолькоПросмотр = Истина;		
	КонецЦикла;	
	
КонецПроцедуры
	
#КонецОбласти

#Область ПередачаДанныхИсточникуИзОбработки	

// Функция формирует структуру результата.
// 
// Параметры:
//  Режим - Строка
//  
// Возвращаемое значение:
//   Струкутура
// 
&НаСервере
Функция СформироватьСтруктуруРезультата(Режим)

	РезСтруктура = Новый Структура;
	РезСтруктура.Вставить("Режим", 	   Режим);
	РезСтруктура.Вставить("ИмяКласса", "РезультатПолученияДанныхПоИсточникам");
	РезСтруктура.Вставить("ИмяЗаполняемойТаблицы", Объект.ИмяЗаполняемойТаблицы);
	
	МассивСтрок = Новый Массив;
	
	НайденныеСтроки = ТаблицаДанные.НайтиСтроки(Новый Структура("Выполнять", Истина));
	КолСтрок = НайденныеСтроки.Количество();
	РезСтруктура.Вставить("КоличествоСтрок", КолСтрок);
	
	Если КолСтрок > 0 Тогда
		ТабЗнДанные = ТаблицаДанные.Выгрузить(НайденныеСтроки);
	Иначе
		ТабЗнДанные = Неопределено;
	КонецЕсли;	
	
	ХранилищеДанные = бит_ОбщегоНазначения.УпаковатьТаблицуЗначений(ТабЗнДанные);
	РезСтруктура.Вставить("ХранилищеДанные", ХранилищеДанные);
		              
	Возврат РезСтруктура;
	
КонецФункции

// Процедура опововещает форму-владельца о выборе данных.
// 
// Параметры:
//  Режим - Строка.
// 
&НаКлиенте
Процедура ОповеститьОВыбореДанных(Режим)

	РезСтруктура = СформироватьСтруктуруРезультата(Режим);
	
	Если РезСтруктура.КоличествоСтрок > 0 Тогда
		ОповеститьОВыборе(РезСтруктура);
	Иначе
	    ТекстСообщения = НСтр("ru='Не выбраны строки для переноса в документ.';
							  |en='Line to be transfered to the document are not selected.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли; 

КонецПроцедуры

#КонецОбласти

#КонецОбласти
